// 영화정보객체 js 

// 다미 객체 /////////////////////////////
var mov = {
    // 1. 영화제목
    name: "Eternal Sunshine Of The Spotless Mind",
    // 2. 감동
    director: "Michel Gondry",
    // 3. 배우
    actor: "Jim Carrey & Kate Elizabeth Winslet",
    // 4. 장르
    genre: "Romance",
    // 5. 관람가
    MPAA: "R",
    // 6. 예고편
    예고편: function(){
        // 1. 호출확인
        // alert("예고편");

        // 플레이함수 호출
        playMv("qmth-PGDD0Q");
    } //////// 예고편 메서드 ////////
   }; ////////// mov 객체 /////////////

   var mvtxt = {
    // 1. 영화제목
        제목: "올빼미/",
    // 2. 감독
        감독: "안태진/",
    // 3. 배우
        배우: "류준열, 유해진/",
    // 4. 장르
        장르: "스릴러/",
    // 5. 관람가
        관람가: "15세 관람가",
    // 6. 예고편
        예고편: function () {
            // 1. 호출확인
            // alert("예고편");

            // 플레이함수 호출
            playMv("eRX5_KUyx7c");
        } ///// 예고편 메서드 ////
}; ///////////// mvtxt 객체 //////////////

// 정찬객체
var jcObj = {
                // 1.영화제목
                제목:"범죄도시2",
                // 2. 감독
                감독:"이상용",
                // 3. 배우
                배우:"마동석,손석구",
                // 4. 장르
                장르:"범죄오락",
                // 5. 관람가
                관람가:"15세 관람가",
                // 6. 예고편
                예고편:function(){
                    // 1. 호출확인
                    //alert("예고편");

                    // 플레이함수 호출
                    playMv("aw9j_23nORs");
                    

                }///////예고편 매서드////////
            }; ////////// jcObj 객체 ////////////

